

Задачи на тему: Int

1)Создайте три переменные с типом данных int, первые две переменные сложите, затем умножьте на третью.
Пример:
Ввод: 5, 10, 2
Вывод: 30

2)Создайте две переменные, выведите остаток от деления первого числа на второе.
Пример:
Ввод: 10, 3
Вывод: 1

3)Принимайте от пользователя его возраст, и выводите след.сообщение “You are age:”
Пример:
Ввод: 20
Вывод: “You are age: 20”

4)Принимайте от пользователя 2 числа, затем выводите их сумму, разность, произведение и деление.
Пример:
Ввод: 10, 2
Вывод: 12, 8, 20, 5





name = 5
name1 = 10
name2 = 2
name4 = (name + name1)*name2
print(name4)



a = 10
b = 3
c = a // b
print(c)
4


age = int(input("Your age:"))
print('Your age',age)







number1 = int(input("Enter user number:"))
number2 = int(input("Enter user number2:"))
print(number1+number2, number1-number2, number1*number2, float(number1/number2))

