


# Solutions: 

# Task1: 

# abc = list(input())

# for i in abc: 
#     print(max(abc))
#     break


#Task2: 

# import random
# b = random.randint(1,1000000000)
# a = int(input("Enter number:"))

# if a == b:
#     print(b)
#     print("True")
# else: 
#     print("False")
#     print("random number was this, you dummy:", b)


#Task3: 

# num = int(input("enter a number: "))
 
# fac = 1
 
# for i in range(1, num + 1):
# 	fac = fac * i
 
# print("factorial of ", num, " is ", fac)

# Task4: 

for i in range(1,10):
     for j in range(1,10):
          print(i*j, end='\t')
     print()

       
    


# Таски по циклам

# 1.Напишите программу, которая будет находить наибольшую цифру натурального числа. Натуральное число вводится с клавиатуры. Найти его наибольшую цифру. Например:
# Ввод: 764580
# Вывод: 8

# 2. Написать программу для игры: Загадывается число (использовать функцию random). Пользователю предлагается угадать число. Если пользователь не угадывает, то ему предлагается угадать число снова и выдается подсказка, что число больше или меньше введенного. Так бесконечно, пока пользователь не введёт слово exit. Бесконечный цикл организовать через while True:

# 3. Напишите программу, которая найдет факториал введенного числа.
# Пример:
# Ввод: 4
# Вывод: 24

# 4. Создайте таблицу умножения, используя Python и цикл for. 
# Вывод: 

# 1       2       3        4        5         6       7        8        9
# 2       4       6        8        10      12      14      16      18
# 3       6       9        12      15      18      21      24      27
# 4       8       12      16      20      24      28      32      36
# 5       10     15      20      25      30      35      40      45
# 6       12     18      24      30      36      42      48      54
# 7       14     21      28      35      42      49      56      63
# 8       16     24      32      40      48      56      64      72
# 9       18     27      36      45      54      63      72      81






